BOQ/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеОтчетыИОбработки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаОтчет</name>
    <type>
      <types>EnumRef.ОбработкаОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Общий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BOQ/src/Catalogs/ДополнительныеОтчетыИОбработки/Forms/Список/Module.bsl
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере ( ИмяЭлемента, Настройки, Строки )
	
	заполнитьРазделы ( Строки );
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура заполнитьРазделы ( Данные )
	
	мРазделы = Новый Массив ();
	Для Каждого строкаДС Из Данные Цикл
		мРазделы.Добавить ( строкаДС.Ключ );		
	КонецЦикла; 
	с = "
	|выбрать
	|	Ссылка как Ссылка, 
	|	представление ( Раздел ) как Раздел
	|из
	|	Справочник.ДополнительныеОтчетыИОбработки.Разделы
	|где
	|	Ссылка в ( &МассивРазделы )
	|упорядочить по
	|	Ссылка.Наименование 
	|итоги
	|по
	|	Ссылка 
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "МассивРазделы", мРазделы );
	результат = запрос.Выполнить ();
	выборкаИтоги = результат.Выбрать ( ОбходРезультатаЗапроса.ПоГруппировкам );
	Пока ( выборкаИтоги.Следующий () ) Цикл
		спрСсылка = выборкаИтоги.Ссылка;
		с = "";
		выборка = выборкаИтоги.Выбрать ( ОбходРезультатаЗапроса.Прямой );
		Пока выборка.Следующий () Цикл
			с = с + ? ( с = "", "", ", " ) + выборка.Раздел;			
		КонецЦикла;
		Данные [ спрСсылка ].Данные.Разделы = с;
	КонецЦикла;
	
КонецПроцедуры
